In [36]:
%%time
import pandas as pd
xls = pd.ExcelFile('./Housing_Prices_2005_2023.xlsx')
df = pd.DataFrame()
cities_df = pd.DataFrame()
#run through all the sheets in file
for sheet in xls.sheet_names:
    sheet_df=pd.read_excel('Housing_Prices_2005_2023.xlsx', sheet_name=sheet)
    province = ['BRITISH_COLUMBIA','ALBERTA','SASKATCHEWAN', 'WINNIPEG', 'ONTARIO','QUEBEC','NOVA_SCOTIA','PRINCE_EDWARD_ISLAND','NEWFOUNDLAND_AND_LABRADOR','NEW_BRUNSWICK']
    if sheet in province:
        # There is no Manitoba in dataset but Winniped present as only city for this province
        sheet = 'MANITOBA' if sheet== 'WINNIPEG' else sheet
        sheet_df['Location'] = sheet
        df = pd.concat([df,sheet_df])
    else:
        sheet_df['Location'] = sheet    
        cities_df = pd.concat([cities_df,sheet_df])
df.head

CPU times: total: 16 s
Wall time: 16.1 s

<bound method NDFrame.head of           Date  Composite_HPI_SA  Single_Family_HPI_SA  One_Storey_HPI_SA
0   2005-01-01             100.0                 100.0              100.0  \
1   2005-02-01             100.6                 100.5              100.8
2   2005-03-01             101.4                 101.2              102.0
3   2005-04-01             101.9                 101.8              102.8
4   2005-05-01             102.6                 102.3              103.6
..         ...               ...                   ...                ...
216 2023-01-01             214.7                 215.7              231.6
217 2023-02-01             214.9                 215.8              231.0
218 2023-03-01             213.6                 214.7              228.6
219 2023-04-01             215.0                 215.9              230.2
220 2023-05-01             216.6                 217.6              230.6

     Two_Storey_HPI_SA  Townhouse_HPI_SA  Apartment_HPI_SA
0                100.0             100.0             100.0  \
1                100.3             100.7             101.0
2                100.6             101.3             102.2
3                101.0             101.9             102.9
4                101.4             102.5             103.7
..                 ...               ...               ...
216              204.7             200.8             214.6
217              206.3             199.0             212.1
218              205.5             200.8             207.9
219              207.7             209.1             206.4
220              211.0             219.5             209.8

     Composite_Benchmark_SA  Single_Family_Benchmark_SA
0                    294700                      368300  \
1                    296600                      370200
2                    298700                      372700
3                    300400                      374800
4                    302300                      376900
..                      ...                         ...
216                  280200                      281900
217                  280400                      282000
218                  278800                      280600
219                  280600                      282200
220                  282600                      284400

     One_Storey_Benchmark_SA  Two_Storey_Benchmark_SA  Townhouse_Benchmark_SA
0                     287300                   469000                243100.0  \
1                     289500                   470500                244900.0
2                     293000                   471700                246300.0
3                     295400                   473500                247600.0
4                     297500                   475400                249100.0
..                       ...                      ...                     ...
216                   262400                   317500                260100.0
217                   261700                   319900                257700.0
218                   259000                   318800                260000.0
219                   260800                   322100                270800.0
220                   261300                   327200                284200.0

     Apartment_Benchmark_SA                   Location
0                  190200.0           BRITISH_COLUMBIA
1                  192100.0           BRITISH_COLUMBIA
2                  194400.0           BRITISH_COLUMBIA
3                  195700.0           BRITISH_COLUMBIA
4                  197200.0           BRITISH_COLUMBIA
..                      ...                        ...
216                231100.0  NEWFOUNDLAND_AND_LABRADOR
217                228400.0  NEWFOUNDLAND_AND_LABRADOR
218                223900.0  NEWFOUNDLAND_AND_LABRADOR
219                222300.0  NEWFOUNDLAND_AND_LABRADOR
220                226000.0  NEWFOUNDLAND_AND_LABRADOR

[2210 rows x 14 columns]>

In [37]:
df.columns

Index(['Date', 'Composite_HPI_SA', 'Single_Family_HPI_SA', 'One_Storey_HPI_SA',
       'Two_Storey_HPI_SA', 'Townhouse_HPI_SA', 'Apartment_HPI_SA',
       'Composite_Benchmark_SA', 'Single_Family_Benchmark_SA',
       'One_Storey_Benchmark_SA', 'Two_Storey_Benchmark_SA',
       'Townhouse_Benchmark_SA', 'Apartment_Benchmark_SA', 'Location'],
      dtype='object')

In [38]:
df.shape

(2210, 14)

In [39]:
%time
df.drop('Composite_HPI_SA', axis=1,inplace=True)
df.drop('Single_Family_HPI_SA', axis=1,inplace=True)
df.drop('One_Storey_HPI_SA', axis=1,inplace=True)
df.drop('Two_Storey_HPI_SA', axis=1,inplace=True)
df.drop('Townhouse_HPI_SA', axis=1,inplace=True)
df.drop('Apartment_HPI_SA', axis=1,inplace=True)
df.drop('Composite_Benchmark_SA', axis=1,inplace=True)

df.columns

CPU times: total: 0 ns
Wall time: 0 ns

Index(['Date', 'Single_Family_Benchmark_SA', 'One_Storey_Benchmark_SA',
       'Two_Storey_Benchmark_SA', 'Townhouse_Benchmark_SA',
       'Apartment_Benchmark_SA', 'Location'],
      dtype='object')

In [40]:
df = df.rename(columns={'Single_Family_Benchmark_SA': 'Single_Family', 
                        'One_Storey_Benchmark_SA': 'One_Storey',
                        'Two_Storey_Benchmark_SA': 'Two_Storey',
                        'Townhouse_Benchmark_SA' : 'Townhouse',
                        'Apartment_Benchmark_SA' : 'Apartment'
                        })

In [41]:
df.shape

(2210, 7)

In [42]:
%%time
df.drop_duplicates(inplace = True)

CPU times: total: 0 ns
Wall time: 3 ms

In [43]:
df.shape

(2210, 7)

In [44]:
#convert some columns into rows
df=df.melt(id_vars = ['Date','Location'], var_name ='House_type', value_name='Benchmark_Price')
df.head(20)

         Date          Location     House_type  Benchmark_Price
0  2005-01-01  BRITISH_COLUMBIA  Single_Family         368300.0
1  2005-02-01  BRITISH_COLUMBIA  Single_Family         370200.0
2  2005-03-01  BRITISH_COLUMBIA  Single_Family         372700.0
3  2005-04-01  BRITISH_COLUMBIA  Single_Family         374800.0
4  2005-05-01  BRITISH_COLUMBIA  Single_Family         376900.0
5  2005-06-01  BRITISH_COLUMBIA  Single_Family         378900.0
6  2005-07-01  BRITISH_COLUMBIA  Single_Family         385500.0
7  2005-08-01  BRITISH_COLUMBIA  Single_Family         391300.0
8  2005-09-01  BRITISH_COLUMBIA  Single_Family         397600.0
9  2005-10-01  BRITISH_COLUMBIA  Single_Family         403200.0
10 2005-11-01  BRITISH_COLUMBIA  Single_Family         409600.0
11 2005-12-01  BRITISH_COLUMBIA  Single_Family         416200.0
12 2006-01-01  BRITISH_COLUMBIA  Single_Family         421900.0
13 2006-02-01  BRITISH_COLUMBIA  Single_Family         428300.0
14 2006-03-01  BRITISH_COLUMBIA  Single_Family         433700.0
15 2006-04-01  BRITISH_COLUMBIA  Single_Family         440000.0
16 2006-05-01  BRITISH_COLUMBIA  Single_Family         446400.0
17 2006-06-01  BRITISH_COLUMBIA  Single_Family         452000.0
18 2006-07-01  BRITISH_COLUMBIA  Single_Family         457800.0
19 2006-08-01  BRITISH_COLUMBIA  Single_Family         463500.0

In [45]:
#Is there any null values in dataset
total = df.isnull().sum()
print(total)

Date                 0
Location             0
House_type           0
Benchmark_Price    442
dtype: int64

442 Benchmark Prices with Null values found

In [46]:
df2 = df[df['Benchmark_Price'].isnull()]
df2.head(10)

           Date              Location House_type  Benchmark_Price
8398 2005-01-01  PRINCE_EDWARD_ISLAND  Townhouse              NaN
8399 2005-02-01  PRINCE_EDWARD_ISLAND  Townhouse              NaN
8400 2005-03-01  PRINCE_EDWARD_ISLAND  Townhouse              NaN
8401 2005-04-01  PRINCE_EDWARD_ISLAND  Townhouse              NaN
8402 2005-05-01  PRINCE_EDWARD_ISLAND  Townhouse              NaN
8403 2005-06-01  PRINCE_EDWARD_ISLAND  Townhouse              NaN
8404 2005-07-01  PRINCE_EDWARD_ISLAND  Townhouse              NaN
8405 2005-08-01  PRINCE_EDWARD_ISLAND  Townhouse              NaN
8406 2005-09-01  PRINCE_EDWARD_ISLAND  Townhouse              NaN
8407 2005-10-01  PRINCE_EDWARD_ISLAND  Townhouse              NaN

In [47]:

df2['Location'].unique()

array(['PRINCE_EDWARD_ISLAND'], dtype=object)

In [48]:
df2['House_type'].unique()

array(['Townhouse', 'Apartment'], dtype=object)

Considering the provided information, assuming there are null values in the records of Townhouses and Apartments in PRINCE_EDWARD_ISLANDS, in order to establish benchmark prices, we will proceed by assigning a value of 0 to all those null entries.

In [49]:
df['Benchmark_Price'] = df['Benchmark_Price'].fillna(0)

In [50]:
# Lets make sure no more null values
total = df.isnull().sum()
print(total)

Date               0
Location           0
House_type         0
Benchmark_Price    0
dtype: int64

There are no more null values in data set

In [51]:
import pyodbc

cnxn = pyodbc.connect(
      r'Driver=SQL Server;'
    r'Server=xxxxx;'
    r'Database=Housing;'
    r'Trusted_Connection=yes;')
  
cursor = cnxn.cursor()
province = df['Location'].unique()
type = df['House_type'].unique()

codes =['BC','AB','SK','MB','ON','QC','NB','NS','PE','NL']
values=list(zip(codes,province))

sql = "INSERT INTO PROVINCE (ProvinceCode,Name) VALUES (?,?)"
try:
    cursor.executemany(sql,values)
    cursor.commit()
except:
    pass  

sql = "INSERT INTO HouseType (Name) VALUES (?)"
try:
    cursor.executemany(sql,list(zip(type)))
    cursor.commit()
except:
    pass     
df.columns
for row in df.itertuples():
    # get the related tables related Id's for referencial intergraion
    try:
        cursor.execute('select TypeID from HouseType where Name = ?',row[3])
        type = cursor.fetchone()[0]
    except:
        pass    
    try:
        cursor.execute('select ProvinceID from Province where Name = ?',row[2])
        prov = cursor.fetchone()[0]
    except:    
        pass
    try:
        cursor.execute('select MortgageRateID from MortgageRates where str(Year(Date))=? and str(Month(Date)) =?',(row[5],row[6]))
        rates = cursor.fetchone()[0]
    except:
        pass    
    try:
        cursor.execute('select InflationID from Inflation where str(Year(Date))=? ',row[5])
        inf = cursor.fetchone()[0]
    except:
        pass
    try:    
        cursor.execute('select GdpID from CanadaGDP where str(Year(Date))=? ',row[5])
        gdp = cursor.fetchone()[0]
    except:
        pass    



    sql = "INSERT INTO HousePrices (Date,HouseType,MortgageRates,GDP,Inflation,Province,BenchMarkPrice) VALUES(?,?,?,?,?,?,?)"
    try:
        cursor.execute(sql,row[1],type,rates,gdp,inf,prov,row[4])
        cursor.commit()
    except:
        pass

cursor.close()